Ninety_Nine_Cats_Rails/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 14], ["start_date", "2020-10-27"], ["end_date", "2020-10-31"], ["created_at", "2020-10-27 17:46:00.893588"], ["updated_at", "2020-10-27 17:46:00.893588"]]
---
    def create
      @rental_request = CatRentalRequest.new(cat_rental_request_params)
      if @rental_request.save!

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def approve
      @rental_request = CatRentalRequest.find(params[:id])