React/Bench_BnB/app/controllers/api/benches_controller.rb

  def index
    benches = bounds ? Bench.in_bounds(bounds) : Bench.all

    if params[:minSeating] && params[:maxSeating]
      @benches = benches.where(seating: seating_range)
---
SELECT "benches".* FROM "benches" WHERE (lat < '37.809713098290686') AND (lat > '37.74187133792972') AND (lng > '-122.47791534423827') AND (lng < '-122.3920846557617')
SELECT "benches".* FROM "benches" WHERE (lat < '37.809713098290686') AND (lat > '37.74187133792972') AND (lng > '-122.47791534423827') AND (lng < '-122.3920846557617') AND "benches"."seating" BETWEEN $1 AND $2  [["seating", 1], ["seating", 10]]

  def show
    @bench = Bench.find(params[:id])
---
SELECT  "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @bench = Bench.new(bench_params)

    if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at", "seating") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"