Music_App_Rails/app/controllers/albums_controller.rb

  def create
    album = Album.new(album_params)

    if album.save
---
INSERT INTO "albums" ("name", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "The Blood of the Innocent"], ["year", 1988], ["band_id", 12], ["created_at", "2020-11-10 21:07:17.473165"], ["updated_at", "2020-11-10 21:07:17.473165"]]

  def show
    @tracks = Track.where(album_id: params[:id])
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def update
    album = Album.find(params[:id])

    if album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "albums" SET "name" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["name", "The Blood of the Innocent!"], ["updated_at", "2020-11-10 20:56:35.769591"], ["id", 15]]

  def destroy
    album = Album.find(params[:id])
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 15]]