Music_App_Rails/app/controllers/bands_controller.rb

  def index
    @bands = Band.search(params[:search])
---
SELECT "bands".* FROM "bands"

  def create
    band = Band.new(band_params)

    if logged_in?
      band.save
      if !band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Alamo"], ["created_at", "2020-11-10 00:46:20.279908"], ["updated_at", "2020-11-10 00:46:20.279908"]]
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Alamo!"], ["created_at", "2020-11-10 01:56:09.689056"], ["updated_at", "2020-11-10 01:56:09.689056"]]

  def update
    band = Band.find(params[:id])

    if band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Alamo!!"], ["updated_at", "2020-11-10 01:58:54.476802"], ["id", 8]]

  def destroy
    band = Band.find(params[:id])
    band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 8]]