Music_App_Rails/app/views/bands/show.html.erb

        <tbody>
          <% @band.albums.order(:name).each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY "albums"."name" ASC  [["band_id", 10]]