React/Todo_List/Todo_List_App/app/controllers/api/steps_controller.rb

SELECT "steps".* FROM "steps"
---
  def index
    render json: Step.all

INSERT INTO "steps" ("title", "body", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "come"], ["body", "on"], ["todo_id", 2], ["created_at", "2021-02-01 01:55:03.321012"], ["updated_at", "2021-02-01 01:55:03.321012"]]
---
  def create
    @step = Step.new(step_params)

    if @step.save

SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "steps" SET "done" = $1, "updated_at" = $2 WHERE "steps"."id" = $3  [["done", true], ["updated_at", "2021-02-01 02:27:41.919745"], ["id", 1]]
---
  def update
    @step = Step.find(params[:id])

    if @step.update_attributes(step_params)