React/Todo_List/Todo_List_App/app/controllers/api/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Fun "], ["body", "Activities"], ["created_at", "2021-02-01 03:54:24.222753"], ["updated_at", "2021-02-01 03:54:24.222753"]]

  def update
    @todo = Todo.find(params[:id])

    if @todo.update_attributes(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2021-02-01 00:40:09.441964"], ["id", 1]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]