Reach_Your_Goals/app/controllers/comments_controller.rb

    def create


      case
      when params[:user_id]
        user_comment = UserComment.new(user_comment_params)
        if user_comment.save
          flash[:notices] = ["Comment posted"]
          redirect_to user_url(user_comment.user_id)
        else
          flash[:errors] = user_comment.errors.full_messages
          redirect_to user_url(user_comment.user_id)
        end
      when params[:goal_id]
        user_id = params[:goal_comment][:user_id]
        goal_comment = GoalComment.new(goal_comment_params)
        if goal_comment.save
---
INSERT INTO "user_comments" ("author_id", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 5], ["content", "Just wanted to say hi again"], ["created_at", "2020-12-10 17:13:26.459755"], ["updated_at", "2020-12-10 17:13:26.459755"], ["user_id", 6]]
INSERT INTO "goal_comments" ("author_id", "content", "created_at", "updated_at", "goal_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 5], ["content", "Wow this is great"], ["created_at", "2020-12-10 17:59:53.430353"], ["updated_at", "2020-12-10 17:59:53.430353"], ["goal_id", 13]]