Reach_Your_Goals/app/controllers/goals_controller.rb

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 261], ["LIMIT", 1]]
UPDATE "goals" SET "completed" = $1, "updated_at" = $2 WHERE "goals"."id" = $3  [["completed", true], ["updated_at", "2020-11-28 23:21:47.886014"], ["id", 261]]
---
    def toggle_completed
      goal = Goal.find(params[:id])
      goal.toggle_completed!