Reach_Your_Goals/app/controllers/goals_controller.rb

    def index
      @goals = Goal.all
---
SELECT "goals".* FROM "goals"

    def create
      goal = Goal.new(goal_params)

      if goal.save
---
INSERT INTO "goals" ("user_id", "title", "description", "private", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 6], ["title", "gf"], ["description", "get a gf"], ["private", true], ["created_at", "2020-11-28 21:12:06.142349"], ["updated_at", "2020-11-28 21:12:06.142349"]]

    def show
     @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def edit
      @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

    def update
      @goal = Goal.find(params[:id])

      if @goal.update_attributes(goal_params)
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
UPDATE "goals" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["title", "Lose twenty pounds!"], ["description", "I want to lose twenty pounds!"], ["updated_at", "2020-11-27 00:03:32.578575"], ["id", 64]]

    def destroy
      goal = Goal.find(params[:id])
      goal.destroy
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 4]]