Reach_Your_Goals/app/controllers/users_controller.rb

    def show
      @user = User.includes(:comments).find(params[:id])
      @cheers = User.includes(:cheers).find(params[:id])
      @complete_goals = User.find(params[:id]).goals.includes(:comments).where(completed: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."user_id" = $1  [["user_id", 6]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1 AND "goals"."completed" = $2  [["user_id", 6], ["completed", false]]