Music_App_Rails/app/views/albums/edit.html.erb

<select id='album-band' name="albums[band_id]">
<% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"