First_Routes_And_Controllers/app/controllers/artwork_shares_controller.rb

    def create
      share = ArtworkShare.new(artwork_share_params)

      if share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 8], ["created_at", "2020-10-21 14:35:28.926854"], ["updated_at", "2020-10-21 14:35:28.926854"]]

    def destroy
      share = ArtworkShare.find(params[:id])
      share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]