First_Routes_And_Controllers/app/controllers/artworks_controller.rb

  def create
    artwork = Artwork.new(artwork_params)

    if artwork.save!
---
INSERT INTO "artworks" ("artist_id", "title", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist_id", 9], ["title", "The Largest Slug"], ["image_url", "www.abc.com/12345"], ["created_at", "2020-10-20 22:40:41.182925"], ["updated_at", "2020-10-20 22:40:41.182925"]]

  def like
    like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')
    if like.save!
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["likeable_type", "Artwork"], ["likeable_id", 8], ["created_at", "2020-10-21 22:48:10.228938"], ["updated_at", "2020-10-21 22:48:10.228938"]]

  def unlike
    like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Artwork')
    if like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 9], ["likeable_id", 8], ["likeable_type", "Artwork"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]

  def favorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
    artwork.favorite = true
    artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 8], ["artist_id", 11], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2020-10-21 23:03:31.594390"], ["id", 9]]

  def unfavorite
    artwork = Artwork.find_by(id: params[:id], artist_id: params[:user_id])
    artwork.favorite = false
    artwork.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 AND "artworks"."artist_id" = $2 LIMIT $3  [["id", 8], ["artist_id", 11], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", false], ["updated_at", "2020-10-21 23:04:43.402160"], ["id", 9]]