First_Routes_And_Controllers/app/controllers/collections_controller.rb

    def create
      artwork = Collection.new(collection_params)
      if artwork.save!
---
INSERT INTO "collections" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["name", "The Big Ball Collection"], ["created_at", "2020-10-22 00:52:57.134859"], ["updated_at", "2020-10-22 00:52:57.134859"]]

    def show
      artwork = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
      collection = Collection.find(params[:id])
---
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def add_artwork
      artwork_collection = ArtworkCollection.new(
          artwork_id: params[:artwork_id],
          collection_id: params[:collection_id]
        )
      if artwork_collection.save!
---
INSERT INTO "artwork_collections" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 1], ["artwork_id", 1], ["created_at", "2020-10-22 01:44:17.972621"], ["updated_at", "2020-10-22 01:44:17.972621"]]