First_Routes_And_Controllers/app/controllers/comments_controller.rb

    def index
      case
      when params[:user_id]
        comments = Comment.where(user_id: params[:user_id])
      when params[:artwork_id]
        comments = Comment.where(artwork_id: params[:artwork_id])
      else
        comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 9]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 9]]
SELECT "comments".* FROM "comments"

    def create
      comment = Comment.new(comment_params)

      if comment.save!
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Holy crap I just busted"], ["user_id", 9], ["artwork_id", 8], ["created_at", "2020-10-21 17:49:43.492598"], ["updated_at", "2020-10-21 17:49:43.492598"]]

    def destroy
      comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def like
      like = Like.new(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')
      if like.save!
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 8], ["likeable_type", "Comment"], ["likeable_id", 8], ["created_at", "2020-10-21 23:46:34.168811"], ["updated_at", "2020-10-21 23:46:34.168811"]]

    def unlike
      like = Like.find_by(user_id: params[:user_id], likeable_id: params[:id], likeable_type: 'Comment')
      if like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 AND "likes"."likeable_type" = $3 LIMIT $4  [["user_id", 8], ["likeable_id", 1], ["likeable_type", "Comment"], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 7]]