First_Routes_And_Controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%Tully%')
---
    def index
      if params[:query]
        users = User.where('username LIKE ?', "%#{params[:query]}%")
      else
        users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"Bert Johnson\""], ["email", "\"johnson@johnsonandjohnson.com\""], ["created_at", "2020-10-20 18:22:03.788414"], ["updated_at", "2020-10-20 18:22:03.788414"]]
---
    def create
      user = User.new(user_params)
      if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "imabadboy@goodboy.com"], ["updated_at", "2020-10-20 19:06:58.950062"], ["id", 1]]
---
    def update
      user = User.find(params[:id])

      if user.update_attributes(user_params)