React/Bench_BnB/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test "], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jGQ0UPbzcvHAyHiIWV1KDQ"], ["updated_at", "2021-02-05 22:10:39.323057"], ["id", 21]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!