Reach_Your_Goals/app/views/users/show.html.erb

<tbody>
<% @user.comments_on_self.includes(:author).each do |comment| %>
---
SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."user_id" = $1  [["user_id", 6]]

  <% end %>
  <% goal.comments.includes(:author).each do |comment| %>
---
SELECT "goal_comments".* FROM "goal_comments" WHERE "goal_comments"."goal_id" = $1  [["goal_id", 12]]