First_Routes_And_Controllers/app/models/artwork.rb

    def self.artworks_for_user_id(user_id)
      user_artwork = Artwork
        .where('(artworks.artist_id = :user_id)', user_id: user_id)
        .distinct

      artwork_shared_with_user = Artwork
        .left_outer_joins(:artwork_shares)
        .where('(artwork_shares.viewer_id = :user_id)', user_id: user_id)
        .distinct
---
SELECT DISTINCT "artworks".* FROM "artworks" WHERE ((artworks.artist_id = '8'))
SELECT DISTINCT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE ((artwork_shares.viewer_id = '8'))