First_Routes_And_Controllers/app/models/comment.rb

SELECT  1 AS one FROM "comments" WHERE (comments.body LIKE 'Holy crap I just busted') LIMIT $1  [["LIMIT", 1]]
---
    def no_duplicate_comments
    # this is just to practice custom validations, 'in the wild'
    # I would probably figure out a way to allow users to spam a comment
    # a certain number of times before I deemed it invalid...
      past_comment = Comment
          .where('comments.body = ? AND
                  comments.user_id = ?',
                  self.body, self.user_id)
      unless past_comment.empty?