React/Todo_List/Todo_List_App/app/models/todo.rb

SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "libero"], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "officiis"], ["created_at", "2021-02-01 03:22:16.080722"], ["updated_at", "2021-02-01 03:22:16.080722"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "officiis"], ["LIMIT", 1]]
---
  def tag_names=(tag_names)
    self.tags = tag_names.map do |tag_name|
      Tag.find_or_create_by(name: tag_name)