Ninety_Nine_Cats_Rails_I/app/views/cat_rental_requests/new.html.erb

    <option disabled>--Select A Cat--</option>
    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"