Ninety_Nine_Cats_Rails_I/app/models/cat_rental_request.rb

    def approve!
      raise 'not pending' unless self.status == "Pending"
      transaction do
        self.status = "Approved"
        self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "Approved"], ["updated_at", "2020-10-27 19:16:57.927770"], ["id", 16]]